{
  "a0": 0,
  "a1": 1,
  "a2": 2,
  "a3": 3,
  "a4": 4,
  "a5": 5,
  "a6": 6,
  "a7": 7,
  "a8": 8,
  "a9": 9,
  "aa": 10,
  "ab": 11,
  "ad": 12,
  "adc": 13,
  "add": 14,
  "addpd": 15,
  "addsd": 16,
  "addss": 17,
  "and": 18,
  "andnpd": 19,
  "andpd": 20,
  "andps": 21,
  "b0": 22,
  "b1": 23,
  "b2": 24,
  "b4": 25,
  "b5": 26,
  "b6": 27,
  "b7": 28,
  "b8": 29,
  "bb": 30,
  "be": 31,
  "bf": 32,
  "bsf": 33,
  "bsr": 34,
  "bswap": 35,
  "bt": 36,
  "btc": 37,
  "btr": 38,
  "bts": 39,
  "c0": 40,
  "c1": 41,
  "c2": 42,
  "c3": 43,
  "c4": 44,
  "c5": 45,
  "c6": 46,
  "c7": 47,
  "c8": 48,
  "c9": 49,
  "ca": 50,
  "call": 51,
  "cb": 52,
  "cc": 53,
  "cd": 54,
  "cdq": 55,
  "cdqe": 56,
  "ce": 57,
  "cmova": 58,
  "cmovae": 59,
  "cmovb": 60,
  "cmovbe": 61,
  "cmove": 62,
  "cmovg": 63,
  "cmovge": 64,
  "cmovl": 65,
  "cmovle": 66,
  "cmovne": 67,
  "cmovns": 68,
  "cmovp": 69,
  "cmovs": 70,
  "cmp": 71,
  "cmpltsd": 72,
  "cmpnlesd": 73,
  "cmpnltsd": 74,
  "cmpnltss": 75,
  "comisd": 76,
  "comiss": 77,
  "cpuid": 78,
  "cqo": 79,
  "cs": 80,
  "cvtdq2pd": 81,
  "cvtsd2ss": 82,
  "cvtsi2sd": 83,
  "cvtsi2ss": 84,
  "cvtss2sd": 85,
  "cvttpd2dq": 86,
  "cvttsd2si": 87,
  "cvttss2si": 88,
  "cwde": 89,
  "d0": 90,
  "d1": 91,
  "d2": 92,
  "d4": 93,
  "d5": 94,
  "d6": 95,
  "d8": 96,
  "d9": 97,
  "da": 98,
  "data16": 99,
  "db": 100,
  "dc": 101,
  "dd": 102,
  "de": 103,
  "dec": 104,
  "df": 105,
  "div": 106,
  "divpd": 107,
  "divsd": 108,
  "divss": 109,
  "e0": 110,
  "e2": 111,
  "e3": 112,
  "e4": 113,
  "e6": 114,
  "e7": 115,
  "e8": 116,
  "e9": 117,
  "ea": 118,
  "ec": 119,
  "ef": 120,
  "endbr64": 121,
  "f0": 122,
  "f1": 123,
  "f3": 124,
  "f4": 125,
  "f5": 126,
  "f7": 127,
  "f8": 128,
  "f9": 129,
  "fa": 130,
  "fadd": 131,
  "fb": 132,
  "fc": 133,
  "fcomi": 134,
  "fcomip": 135,
  "fd": 136,
  "fdivp": 137,
  "fdivrp": 138,
  "fe": 139,
  "ff": 140,
  "fild": 141,
  "fistp": 142,
  "fld": 143,
  "fldcw": 144,
  "fldz": 145,
  "fmul": 146,
  "fmulp": 147,
  "fnstcw": 148,
  "fnstsw": 149,
  "fprem": 150,
  "fstp": 151,
  "fsubr": 152,
  "fsubrp": 153,
  "fucomip": 154,
  "fxch": 155,
  "hlt": 156,
  "idiv": 157,
  "imul": 158,
  "inc": 159,
  "incsspq": 160,
  "ja": 161,
  "jae": 162,
  "jb": 163,
  "jbe": 164,
  "je": 165,
  "jg": 166,
  "jge": 167,
  "jl": 168,
  "jle": 169,
  "jmp": 170,
  "jne": 171,
  "jno": 172,
  "jnp": 173,
  "jns": 174,
  "jo": 175,
  "jp": 176,
  "js": 177,
  "lea": 178,
  "leave": 179,
  "lock": 180,
  "maxsd": 181,
  "minsd": 182,
  "mov": 183,
  "movabs": 184,
  "movapd": 185,
  "movaps": 186,
  "movd": 187,
  "movdqa": 188,
  "movdqu": 189,
  "movhlps": 190,
  "movhps": 191,
  "movlhps": 192,
  "movlpd": 193,
  "movmskpd": 194,
  "movq": 195,
  "movs": 196,
  "movsd": 197,
  "movss": 198,
  "movsx": 199,
  "movsxd": 200,
  "movupd": 201,
  "movups": 202,
  "movzx": 203,
  "mul": 204,
  "mulpd": 205,
  "mulsd": 206,
  "mulss": 207,
  "neg": 208,
  "nop": 209,
  "not": 210,
  "notrack": 211,
  "or": 212,
  "orpd": 213,
  "orps": 214,
  "packuswb": 215,
  "paddb": 216,
  "paddd": 217,
  "paddq": 218,
  "paddw": 219,
  "pand": 220,
  "pandn": 221,
  "pause": 222,
  "pcmpeqb": 223,
  "pcmpeqd": 224,
  "pcmpgtb": 225,
  "pcmpgtd": 226,
  "pcmpgtw": 227,
  "pextrd": 228,
  "pextrw": 229,
  "pinsrd": 230,
  "pinsrw": 231,
  "pmovmskb": 232,
  "pmulhw": 233,
  "pmullw": 234,
  "pmuludq": 235,
  "pop": 236,
  "por": 237,
  "prefetchnta": 238,
  "prefetcht0": 239,
  "pshufb": 240,
  "pshufd": 241,
  "pshufhw": 242,
  "pshuflw": 243,
  "pslld": 244,
  "psllq": 245,
  "psllw": 246,
  "psrad": 247,
  "psraw": 248,
  "psrld": 249,
  "psrldq": 250,
  "psrlq": 251,
  "psrlw": 252,
  "psubb": 253,
  "psubd": 254,
  "psubq": 255,
  "psubusw": 256,
  "psubw": 257,
  "punpckhbw": 258,
  "punpckhdq": 259,
  "punpckhqdq": 260,
  "punpckhwd": 261,
  "punpcklbw": 262,
  "punpckldq": 263,
  "punpcklqdq": 264,
  "punpcklwd": 265,
  "push": 266,
  "pxor": 267,
  "rdrand": 268,
  "rdseed": 269,
  "rdsspq": 270,
  "rep": 271,
  "ret": 272,
  "rol": 273,
  "ror": 274,
  "sar": 275,
  "sbb": 276,
  "seta": 277,
  "setae": 278,
  "setb": 279,
  "setbe": 280,
  "sete": 281,
  "setg": 282,
  "setge": 283,
  "setl": 284,
  "setle": 285,
  "setne": 286,
  "setnp": 287,
  "setns": 288,
  "seto": 289,
  "setp": 290,
  "sets": 291,
  "sha1msg1": 292,
  "sha1msg2": 293,
  "sha1nexte": 294,
  "sha1rnds4": 295,
  "shl": 296,
  "shld": 297,
  "shr": 298,
  "shrd": 299,
  "shufpd": 300,
  "shufps": 301,
  "sqrtsd": 302,
  "stos": 303,
  "sub": 304,
  "subpd": 305,
  "subsd": 306,
  "subss": 307,
  "test": 308,
  "tzcnt": 309,
  "ucomisd": 310,
  "ucomiss": 311,
  "ud2": 312,
  "unpckhpd": 313,
  "unpcklpd": 314,
  "xchg": 315,
  "xgetbv": 316,
  "xor": 317,
  "xorpd": 318,
  "xorps": 319
}