{
  "a0": 0,
  "a1": 1,
  "a2": 2,
  "a3": 3,
  "a4": 4,
  "a5": 5,
  "a6": 6,
  "a7": 7,
  "a8": 8,
  "a9": 9,
  "aa": 10,
  "ab": 11,
  "ad": 12,
  "adc": 13,
  "add": 14,
  "addpd": 15,
  "addsd": 16,
  "addss": 17,
  "and": 18,
  "andnpd": 19,
  "andpd": 20,
  "andps": 21,
  "b0": 22,
  "b1": 23,
  "b2": 24,
  "b4": 25,
  "b5": 26,
  "b6": 27,
  "b7": 28,
  "b8": 29,
  "bb": 30,
  "be": 31,
  "bf": 32,
  "bsf": 33,
  "bsr": 34,
  "bswap": 35,
  "bt": 36,
  "btc": 37,
  "btr": 38,
  "bts": 39,
  "c0": 40,
  "c1": 41,
  "c2": 42,
  "c3": 43,
  "c4": 44,
  "c5": 45,
  "c6": 46,
  "c7": 47,
  "c8": 48,
  "c9": 49,
  "ca": 50,
  "call": 51,
  "cb": 52,
  "cc": 53,
  "cd": 54,
  "cdq": 55,
  "cdqe": 56,
  "ce": 57,
  "cmova": 58,
  "cmovae": 59,
  "cmovb": 60,
  "cmovbe": 61,
  "cmove": 62,
  "cmovg": 63,
  "cmovge": 64,
  "cmovl": 65,
  "cmovle": 66,
  "cmovne": 67,
  "cmovns": 68,
  "cmovp": 69,
  "cmovs": 70,
  "cmp": 71,
  "cmpltsd": 72,
  "cmpnlesd": 73,
  "cmpnltss": 74,
  "comisd": 75,
  "comiss": 76,
  "cpuid": 77,
  "cqo": 78,
  "cs": 79,
  "cvtsd2ss": 80,
  "cvtsi2sd": 81,
  "cvtsi2ss": 82,
  "cvtss2sd": 83,
  "cvttpd2dq": 84,
  "cvttsd2si": 85,
  "cvttss2si": 86,
  "cwde": 87,
  "d0": 88,
  "d1": 89,
  "d2": 90,
  "d4": 91,
  "d5": 92,
  "d6": 93,
  "d8": 94,
  "d9": 95,
  "data16": 96,
  "db": 97,
  "dc": 98,
  "dd": 99,
  "de": 100,
  "dec": 101,
  "df": 102,
  "div": 103,
  "divpd": 104,
  "divsd": 105,
  "divss": 106,
  "e0": 107,
  "e2": 108,
  "e3": 109,
  "e4": 110,
  "e6": 111,
  "e7": 112,
  "e8": 113,
  "e9": 114,
  "ea": 115,
  "ec": 116,
  "ef": 117,
  "endbr64": 118,
  "f0": 119,
  "f1": 120,
  "f3": 121,
  "f4": 122,
  "f5": 123,
  "f7": 124,
  "f8": 125,
  "f9": 126,
  "fa": 127,
  "fadd": 128,
  "fb": 129,
  "fc": 130,
  "fcomi": 131,
  "fcomip": 132,
  "fd": 133,
  "fdivp": 134,
  "fe": 135,
  "ff": 136,
  "fild": 137,
  "fistp": 138,
  "fld": 139,
  "fldcw": 140,
  "fmulp": 141,
  "fnstcw": 142,
  "fnstsw": 143,
  "fprem": 144,
  "fstp": 145,
  "fsubr": 146,
  "fucomip": 147,
  "fxch": 148,
  "hlt": 149,
  "idiv": 150,
  "imul": 151,
  "inc": 152,
  "incsspq": 153,
  "ja": 154,
  "jae": 155,
  "jb": 156,
  "jbe": 157,
  "je": 158,
  "jg": 159,
  "jge": 160,
  "jl": 161,
  "jle": 162,
  "jmp": 163,
  "jne": 164,
  "jno": 165,
  "jnp": 166,
  "jns": 167,
  "jo": 168,
  "jp": 169,
  "js": 170,
  "lea": 171,
  "leave": 172,
  "lock": 173,
  "maxsd": 174,
  "minsd": 175,
  "mov": 176,
  "movabs": 177,
  "movapd": 178,
  "movaps": 179,
  "movd": 180,
  "movdqa": 181,
  "movdqu": 182,
  "movhlps": 183,
  "movhps": 184,
  "movq": 185,
  "movsd": 186,
  "movss": 187,
  "movsx": 188,
  "movsxd": 189,
  "movupd": 190,
  "movups": 191,
  "movzx": 192,
  "mul": 193,
  "mulpd": 194,
  "mulsd": 195,
  "mulss": 196,
  "neg": 197,
  "nop": 198,
  "not": 199,
  "notrack": 200,
  "or": 201,
  "orpd": 202,
  "orps": 203,
  "packuswb": 204,
  "paddb": 205,
  "paddd": 206,
  "paddq": 207,
  "pand": 208,
  "pandn": 209,
  "pause": 210,
  "pcmpeqb": 211,
  "pcmpeqd": 212,
  "pcmpgtb": 213,
  "pcmpgtd": 214,
  "pextrw": 215,
  "pinsrw": 216,
  "pop": 217,
  "por": 218,
  "prefetchnta": 219,
  "prefetcht0": 220,
  "pshufd": 221,
  "pshuflw": 222,
  "pslld": 223,
  "psllq": 224,
  "psllw": 225,
  "psrad": 226,
  "psraw": 227,
  "psrld": 228,
  "psrldq": 229,
  "psrlq": 230,
  "psrlw": 231,
  "psubb": 232,
  "psubd": 233,
  "psubq": 234,
  "psubusw": 235,
  "punpckhbw": 236,
  "punpckhdq": 237,
  "punpckhqdq": 238,
  "punpckhwd": 239,
  "punpcklbw": 240,
  "punpckldq": 241,
  "punpcklqdq": 242,
  "punpcklwd": 243,
  "push": 244,
  "pxor": 245,
  "rdrand": 246,
  "rdseed": 247,
  "rdsspq": 248,
  "rep": 249,
  "ret": 250,
  "rol": 251,
  "ror": 252,
  "sar": 253,
  "sbb": 254,
  "seta": 255,
  "setae": 256,
  "setb": 257,
  "setbe": 258,
  "sete": 259,
  "setg": 260,
  "setge": 261,
  "setl": 262,
  "setle": 263,
  "setne": 264,
  "setnp": 265,
  "setns": 266,
  "seto": 267,
  "setp": 268,
  "sets": 269,
  "shl": 270,
  "shld": 271,
  "shr": 272,
  "shrd": 273,
  "shufpd": 274,
  "shufps": 275,
  "sqrtsd": 276,
  "sub": 277,
  "subpd": 278,
  "subsd": 279,
  "subss": 280,
  "test": 281,
  "tzcnt": 282,
  "ucomisd": 283,
  "ucomiss": 284,
  "ud2": 285,
  "unpckhpd": 286,
  "unpcklpd": 287,
  "xchg": 288,
  "xgetbv": 289,
  "xor": 290,
  "xorpd": 291,
  "xorps": 292
}